#+TITLE: DM1 Week 02 Prepare
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"../week00/00-prepare.org")][Read Instructions]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
* TODO Key Terms
** Identify
** Define
** Give Example

* TODO Exercises
** Excerses

* TODO Elisp
** Factorial Function
#+BEGIN_SRC elisp
(defun factorial (num)
   (if (> num 1)
      (* num (factorial(1- num)))
      1 ))
#+END_SRC

#+RESULTS:
: factorial

#+BEGIN_SRC elisp
(factorial 6)
#+END_SRC

#+RESULTS:
: 720

** A "use able" function that uses mapcar
** A function that uses a loop

* Special Report
** Paragraph explaining
** exercises-verse-problems.org
** Create and approve project and get it done.
